[
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Ashok Sharma / AP",
    "title": "India Is Cautiously Trying to Recover the Body of an American From an Isolated Island",
    "description": "Indian officials have traveled repeatedly in recent days near the remote North Sentinel Island where an American missionary was killed",
    "url": "http://time.com/5463121/india-american-missionary-killed-north-sentinel-island/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/gettyimages-1064345628.jpg?quality=85",
    "publishedAt": "2018-11-26T09:29:06Z",
    "content": "(DELHI) — Indian officials have traveled repeatedly in recent days near the remote island where an American missionary was killed by people who have long resisted the outside world. But they have not set foot onto North Sentinel Island since the killing, and … [+1989 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Associated Press",
    "title": "Saudi Crown Prince Wants to Meet With Erdogan, Turkish Diplomat Says",
    "description": "Turkey's top diplomat says Saudi Crown Prince Mohammed bin Salman has requested to meet Turkish President Recep Tayyip Erdogan",
    "url": "http://time.com/5462220/mohammed-bin-salman-meeting-request-recep-tayyip-erdogan/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/gettyimages-928703462.jpg?quality=85",
    "publishedAt": "2018-11-23T09:59:03Z",
    "content": "Turkey’s top diplomat says Saudi Crown Prince Mohammed bin Salman has requested to meet Turkish President Recep Tayyip Erdogan on the sidelines of the upcoming Group of 20 summit in Buenos Aires. Mevlut Cavusoglu told Turkey’s CNN-Turk television on Friday th… [+690 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Associated Press",
    "title": "1 Teen Dead and 2 Others Injured in an Alabama Mall Shootout",
    "description": "One teen is dead and two others have been injured following a shooting at an Alabama mall prior to Black Friday shopping",
    "url": "http://time.com/5462171/alabama-shooting-riverchase-galleria-mall/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/gettyimages-899711132.jpg?quality=85",
    "publishedAt": "2018-11-23T07:30:47Z",
    "content": "HOOVER, Ala. (AP) — One teen is dead and two others have been injured following a shooting at an Alabama mall prior to Black Friday shopping. Authorities say the shooting happened about 9:30 p.m. Thursday at the Riverchase Galleria in Hoover, a nearby suburb … [+580 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Adil Jawad / AP",
    "title": "Gunmen Attack the Chinese Consulate in Pakistan, Killing Two Police Officers",
    "description": "Three gunmen stormed the Chinese Consulate in Karachi, triggering a shootout that killed two police officers and all the assailants",
    "url": "http://time.com/5462168/gunmen-attack-chinese-consulate-pakistan/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/ap18327235095615.jpg?quality=85",
    "publishedAt": "2018-11-23T07:03:16Z",
    "content": "(KARACHI, Pakistan) — Three gunmen stormed the Chinese Consulate in Pakistan’s southern port city of Karachi on Friday, triggering an intense, hour-long shootout during which two police officers and all the assailants were killed, officials said. All the Chin… [+1938 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Rachel E. Greenspan",
    "title": "The Best Black Friday Deals From Every Major Retailer",
    "description": "From Macy's, to Walmart, to Target and more, find out all the best deals and sales during Thanksgiving and Black Friday 2018.",
    "url": "http://time.com/5456475/best-black-friday-2018/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/best-black-friday-deals-2018-target-macys-walmart.jpg?quality=85",
    "publishedAt": "2018-11-22T12:00:49Z",
    "content": "After the party comes the afterparty, Black Friday 2018 — but, now, what’s long been considered Thanksgiving’s afterparty actually starts with Black Friday deals offered during the main event on Thursday, November 22. Most major retailers will begin their Bla… [+5138 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Associated Press",
    "title": "A Car Plowed Into a Group of Children Outside a School in China, Killing 5",
    "description": "A car plowed into a crowd of children outside a primary school in northeastern China, killing five people and injuring 18",
    "url": "http://time.com/5461992/china-deadly-car-crash-primary-school/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/gettyimages-1057536848.jpg?quality=85",
    "publishedAt": "2018-11-22T08:46:59Z",
    "content": "(BEIJING) — A car plowed into a crowd of children outside a primary school in northeastern China on Thursday, killing five people and injuring 18, a local government spokesman said. The driver was taken into custody after the crash around noon in the coastal … [+1658 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Zeke Miller / AP",
    "title": "President Trump Asked Lawyers to Look into Prosecuting Hillary Clinton and James Comey, Report Says",
    "description": "President Trump told his counsel's office last spring to prosecute political adversaries Hillary Clinton and former FBI Director James Comey",
    "url": "http://time.com/5460921/donald-trump-prosecute-hillary-clinton-james-comey/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/gettyimages-1070206546.jpg?quality=85",
    "publishedAt": "2018-11-21T02:48:41Z",
    "content": "(WASHINGTON) — President Donald Trump told his counsel’s office last spring that he wanted to prosecute political adversaries Hillary Clinton and former FBI Director James Comey, an idea that prompted White House lawyers to prepare a memo warning of consequen… [+1865 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Associated Press",
    "title": "40 People Killed in Suicide Bomb Aimed at Muslim Scholars in Kabul",
    "description": "Afghan officials say a suicide bomber has targeted a gathering of Muslim religious scholars in Kabul, killing at least 40 people.",
    "url": "http://time.com/5459920/40-people-killed-suicide-bomb-kabul/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/afghanistan-suicide-bombing.jpg?quality=85",
    "publishedAt": "2018-11-20T14:55:48Z",
    "content": "(KABUL, Afghanistan) — Afghan officials say a suicide bomber has targeted a gathering of Muslim religious scholars in Kabul, killing at least 40 people. Public Health Ministry spokesman Wahid Majroh says another 60 people were wounded in the attack, which too… [+453 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "George Steer",
    "title": "5 People Were Killed in 3 Separate Shootings Across America on Monday",
    "description": "Three separate shootings across the United States over the last 24 hours have left five people dead and several others injured.",
    "url": "http://time.com/5459845/shootings-chicago-denver-st-louis/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/shootings.jpg?quality=85",
    "publishedAt": "2018-11-20T13:05:35Z",
    "content": "Three separate, high-profile shootings across the United States over the last 24 hours have left five people dead and several others injured. At Mercy Hospital in Chicago, a gunman killed three people, including a police officer and two hospital workers. In D… [+2670 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Ashley Hoffman",
    "title": "The Top 10 Stand Up Comedy Specials of 2018",
    "description": "TIME lists the 10 best stand up comedy specials of 2018 on Netflix you can stream right now.",
    "url": "http://time.com/5444300/best-stand-up-2018/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/best-comedy-specials.jpg?quality=85",
    "publishedAt": "2018-11-20T12:00:57Z",
    "content": "This year offered much vital humor from comedians we can be thankful for—and hopeful about—in 2019. Despite different ideas of what a comedian should do, or be, right now, no one on this year’s list played it safe. In 2018, comics popped open the release valv… [+5164 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Eliana Dockterman",
    "title": "The Top 10 Podcasts of 2018",
    "description": "Here are TIME’s best podcasts of 2018, from 30 for 30: Bikram to Serial season three.",
    "url": "http://time.com/5455070/best-podcasts-2018-2/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/best-podcasts.jpg?quality=85",
    "publishedAt": "2018-11-20T12:00:57Z",
    "content": "Unlike film, television or music, there’s a low barrier to entry in the podcasting world: All you need is a microphone and someone to speak into it. Perhaps the ease and intimacy of podcasting is what drives so many people use the medium to ask uncomfortable … [+5684 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Eben Shapiro",
    "title": "The 10 Best Plays and Musicals of 2018",
    "description": "Find out what made TIME’s list of the best theater of 2018, from 'Harry Potter and the Cursed Child' to 'My Fair Lady.'",
    "url": "http://time.com/5455141/best-plays-musicals-2018/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/best-theatre.jpg?quality=85",
    "publishedAt": "2018-11-20T12:00:19Z",
    "content": "In 2018, the winds of change howled, blowing the dust off of shows that history had seemly rendered irrelevant. Superstar storytellers held audiences in thrall, and a wizard grew up and showed some new tricks. 10. Twelfth Night : Shakespeare in the Park If mu… [+4381 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Kamakshi Ayyar",
    "title": "What We Can Learn From 20 Years of the International Space Station",
    "description": "On Nov. 20, the most ambitious space exploration mission in history celebrated its 20th anniversary",
    "url": "http://time.com/5458488/international-space-station-20-years-anniversary/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/11/iss056e201174.jpg?quality=85",
    "publishedAt": "2018-11-20T10:52:29Z",
    "content": "At a time when most gadgets, on average, last only a handful of years, it’s heartening to note that one of the most complex technological instruments ever built is still going strong. On Nov. 20, the International Space Station (ISS) reached a two-decade mile… [+4730 chars]"
  }
]